abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
  // 3. Enter Stop mode (SLEEPDEEP=1, PDDS=0)
  PWR->CTLR &= ~PWR_CTLR_PDDS; // PDDS = 0
  NVIC->SCTLR |= (1 << 2);     // Set SLEEPDEEP

  __WFI(); // Wait for Interrupt (AWU timer fires in 5s OR user presses button)

  // 4. Cleanup sleep state
  NVIC->SCTLR &= ~(1 << 2); // Clear SLEEPDEEP
  PWR_AutoWakeUpCmd(DISABLE);
  EXTI_ClearITPendingBit(EXTI_Line9);
  NVIC_ClearPendingIRQ(AWU_IRQn);

  // 5. System resumes here after wake up
  SystemCoreClockUpdate();
  EXTI->INTFR = 0xFFFFFFFF;

  DEBUG_PRINT("[PWR] Wake\r\n");

  // Essential re-init after deep sleep
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOC |
                             RCC_APB2Periph_GPIOA | RCC_APB2Periph_ADC1 |
                             RCC_APB2Periph_AFIO | RCC_APB2Periph_SPI1,
                         ENABLE);
  gpio_init();
  adc_init();

  Delay_Ms(5); // Short stabilization delay
}

/* ========== Flash Storage (Last Page 64-byte) ========== */
#define SETTINGS_FLASH_ADDR 0x08003FC0
typedef struct {
  uint16_t tank_id;
  uint8_t pairing_status; // 1 = Paired, 0 = Not Paired
} sensor_settings_t;

sensor_settings_t g_settings;

void flash_read_settings(void) {
  memcpy(&g_settings, (void *)SETTINGS_FLASH_ADDR, sizeof(sensor_settings_t));

  // Check if data is valid (not empty flash 0xFF)
  if (g_settings.tank_id == 0xFFFF) {
    g_settings.tank_id = 0;
    g_settings.pairing_status = 0;
  }
}

void flash_save_settings(void) {
  FLASH_Unlock();
  FLASH_ErasePage(SETTINGS_FLASH_ADDR);

  uint32_t *pData = (uint32_t *)&g_settings;
  for (uint16_t i = 0; i < (sizeof(sensor_settings_t) + 3) / 4; i++) {
    FLASH_ProgramWord(SETTINGS_FLASH_ADDR + (i * 4), pData[i]);
  }
  FLASH_Lock();
  DEBUG_PRINT("[FL] Saved ID:0x%04X S:%d\r\n", g_settings.tank_id,
              g_settings.pairing_status);
}

/* ========== Global Variables ========== */
const uint8_t PAIRING_ADDR[3] = {0xE7, 0xE7,
                                 0xE7}; // Address for pairing packets
volatile uint32_t g_millis = 0;         // Current system time in ms
uint8_t g_probe_fault = 0; // 1 = Fault detected (e.g., gap in readings)

static inline bool is_button_pressed(void) {
  return GPIO_ReadInputDataBit(GPIOD, BUTTON_PIN) == 0;
}

static void reset_runtime_tracking(runtime_state_t *runtime) {
  runtime->button_press_start = 0;
  runtime->pairing_triggered = false;
  runtime->sleep_cycle_count = 0;
  runtime->seq_num = 0;
  runtime->last_sent_level = 0xFF;
  runtime->pending_level = 0xFF;
  runtime->wake_retry_count = 0;
  runtime->filtered_level = 0;
  runtime->candidate_level = 0xFF;
  runtime->candidate_count = 0;
  runtime->first_reading_done = false;
  runtime->current_battery = 0;
  runtime->retry_cooldown = 0;
  runtime->link_quality = 0;
  runtime->last_rpd_seen = 0;
  runtime->link_quality_valid = false;
  g_sensor_event_pending = 0;
  g_button_event_pending = 0;
}

static uint8_t sample_filtered_level(runtime_state_t *runtime) {
  uint8_t raw_level = read_tank_level();

  if (!runtime->first_reading_done) {
    runtime->filtered_level = raw_level;
    runtime->candidate_level = raw_level;
    runtime->candidate_count = 0;
    runtime->first_reading_done = true;
    DEBUG_PRINT("[SYSTEM] Init Level: %d%%\r\n", runtime->filtered_level);
  } else if (raw_level == runtime->filtered_level) {
    // Level is steady and matches confirmed level -> reset candidate tracking
    runtime->candidate_count = 0;
    runtime->candidate_level = raw_level;
  } else {
    // Raw level differs from current confirmed level
    if (raw_level == runtime->candidate_level) {
      runtime->candidate_count++;
      DEBUG_PRINT("[SYS] Candidate Lvl %d%% hold (%d/%d)\r\n",
                  runtime->candidate_level, runtime->candidate_count,
                  LEVEL_DEBOUNCE_CYCLES);

      if (runtime->candidate_count >= LEVEL_DEBOUNCE_CYCLES) {
        runtime->filtered_level = runtime->candidate_level;
        runtime->candidate_count = 0;
        DEBUG_PRINT("[SYS] Lvl Confirmed: %d%%\r\n", runtime->filtered_level);
      }
    } else {
      // First time seeing this new level -> start candidate tracking
      runtime->candidate_level = raw_level;
      runtime->candidate_count = 1;
      DEBUG_PRINT("[SYS] New Candidate Lvl %d%% (1/%d)\r\n",
                  runtime->candidate_level, LEVEL_DEBOUNCE_CYCLES);

#if (LEVEL_DEBOUNCE_CYCLES <= 1)
      runtime->filtered_level = runtime->candidate_level;
      runtime->candidate_count = 0;
      DEBUG_PRINT("[SYS] Lvl Confirmed: %d%%\r\n", runtime->filtered_level);
#endif
    }
  }

  return runtime->filtered_level;
}

static uint8_t build_link_quality_sample(uint8_t attempt, bool ack_received,
                                         bool rpd_seen) {
  if (!ack_received) {
    return rpd_seen ? 10 : 0;
  }

  uint8_t max_attempt = (DATA_MAX_RETRIES > 0) ? (DATA_MAX_RETRIES - 1) : 0;
  if (attempt > max_attempt) {
    attempt = max_attempt;
  }

  uint8_t penalty = 0;
  if (max_attempt > 0) {
    penalty = (uint8_t)(((uint16_t)attempt * 80U) / (uint16_t)max_attempt);
  }

  uint8_t score = (uint8_t)(100U - penalty);
  if (score < 20U) {
    score = 20U;
  }

  if (rpd_seen && score < 100U) {
    uint8_t boosted = (uint8_t)(score + 8U);
    score = (boosted > 100U) ? 100U : boosted;
  }

  return score;
}

static void update_link_quality(runtime_state_t *runtime, uint8_t attempt,
                                bool ack_received, bool rpd_seen) {
  uint8_t sample = build_link_quality_sample(attempt, ack_received, rpd_seen);
  runtime->last_rpd_seen = rpd_seen ? 1 : 0;

  if (!runtime->link_quality_valid) {
    runtime->link_quality = sample;
    runtime->link_quality_valid = true;
    return;
  }

  runtime->link_quality =
      (uint8_t)((((uint16_t)runtime->link_quality * 3U) + sample + 2U) / 4U);
}

static button_action_t poll_button_action(runtime_state_t *runtime) {
  bool button_pressed = is_button_pressed();

  if (button_pressed) {
    uint32_t now = millis();
    if (runtime->button_press_start == 0) {
      runtime->button_press_start = now;
      DEBUG_PRINT("[SYSTEM] Button Pressed\r\n");
    }

    if (!runtime->pairing_triggered &&
        (now - runtime->button_press_start) > RESET_PRESS_TIME_MS) {
      runtime->pairing_triggered = true;
      return BUTTON_ACTION_FACTORY_RESET;
    }

    return BUTTON_ACTION_NONE;
  }

