abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
  if (runtime->button_press_start == 0) {
    return BUTTON_ACTION_NONE;
  }

  uint32_t held_ms = millis() - runtime->button_press_start;
  runtime->button_press_start = 0;

  if (!runtime->pairing_triggered && held_ms > 10 &&
      held_ms < RESET_PRESS_TIME_MS) {
    runtime->pairing_triggered = false;
    if (g_settings.pairing_status == 1) {
      return BUTTON_ACTION_RESET;
    }

    return BUTTON_ACTION_NONE;
  }

  runtime->pairing_triggered = false;
  return BUTTON_ACTION_NONE;
}

static void send_unpair_before_reset(void) {
  DEBUG_PRINT("Sending UNPAIR before reset\r\n");

  uint8_t unpair_pkt[32] = {0};
  unpair_pkt[0] = 0xAA;
  unpair_pkt[1] = 0x55;
  unpair_pkt[2] = 0x06; // PKT_TYPE_UNPAIR
  unpair_pkt[3] = 32;
  unpair_pkt[4] = (uint8_t)(g_settings.tank_id & 0xFF);
  unpair_pkt[5] = (uint8_t)(g_settings.tank_id >> 8);
  unpair_pkt[31] = calculate_checksum(unpair_pkt, 32);

  radio_power_up_tx();
  radio_set_tx_addr(PAIRING_ADDR);
  for (int i = 0; i < 20; i++) {
    radio_send(unpair_pkt, 32);
    Delay_Ms(30);
  }
  radio_power_down();
}

static void handle_button_action(runtime_state_t *runtime,
                                 button_action_t action) {
  runtime->button_press_start = 0;
  runtime->pairing_triggered = false;
  g_button_event_pending = 0;

  if (action == BUTTON_ACTION_NONE) {
    return;
  }

  if (action == BUTTON_ACTION_FACTORY_RESET) {
    DEBUG_PRINT("[SYS] FACTORY RESET\r\n");

    if (g_settings.pairing_status == 1 && g_settings.tank_id != 0) {
      send_unpair_before_reset();
    }

    g_settings.tank_id = 0;
    g_settings.pairing_status = 0;
    flash_save_settings();

    reset_runtime_tracking(runtime);
    run_pairing();
    return;
  }

  DEBUG_PRINT("[SYS] Click -> Reset\r\n");
  Delay_Ms(100);
  NVIC->SCTLR |= (1 << 31); // SYSRESETREQ
}

static bool packet_matches_data_ack(uint8_t *packet, uint32_t seq_num) {
  if (packet[0] != 0xAA || packet[1] != 0x55 ||
      packet[2] != PKT_TYPE_DATA_ACK) {
    return false;
  }

  uint16_t ack_id = (uint16_t)packet[4] | ((uint16_t)packet[5] << 8);
  uint32_t ack_seq = (uint32_t)packet[6] | ((uint32_t)packet[7] << 8) |
                     ((uint32_t)packet[8] << 16) | ((uint32_t)packet[9] << 24);

  return (ack_id == g_settings.tank_id && ack_seq == seq_num);
}

static tx_wait_result_t
service_runtime_window(runtime_state_t *runtime, uint32_t wait_ms,
                       bool listen_for_ack, uint8_t attempt, uint32_t seq_num) {
  uint32_t start = millis();

  while (1) {
    uint32_t now = millis();
    if ((now - start) >= wait_ms) {
      break;
    }

    if (listen_for_ack && radio_available()) {
      uint8_t rx[32];
      radio_read(rx, 32);

      if (packet_matches_data_ack(rx, seq_num)) {
        DEBUG_PRINT("[ACK] OK try:%d\r\n", attempt);
        return TX_WAIT_ACK_RECEIVED;
      }

      for (uint8_t j = 0; j < 32; j++) {
        rx[j] = (uint8_t)~rx[j];
      }

      if (packet_matches_data_ack(rx, seq_num)) {
        DEBUG_PRINT("[ACK] OK(inv) try:%d\r\n", attempt);
        return TX_WAIT_ACK_RECEIVED;
      }
    }

    bool button_pressed = is_button_pressed();
    if (g_button_event_pending || runtime->button_press_start != 0 ||
        button_pressed) {
      g_button_event_pending = 0;
      button_action_t action = poll_button_action(runtime);
      if (action != BUTTON_ACTION_NONE) {
        handle_button_action(runtime, action);
        return TX_WAIT_ABORTED;
      }
    }

    Delay_Ms(1);
  }

  return TX_WAIT_TIMEOUT;
}

static void prepare_data_packet(uint8_t *packet, uint8_t current_level) {
  memset(packet, 0, 32);

  packet[0] = 0xAA;
  packet[1] = 0x55;
  packet[2] = 0x02;
  packet[3] = 32;
  packet[4] = (uint8_t)(g_settings.tank_id & 0xFF);
  packet[5] = (uint8_t)(g_settings.tank_id >> 8);
  packet[6] = current_level;
  packet[7] = g_runtime.current_battery;

  packet[8] = 0;
  if (g_runtime.current_battery <= BATTERY_LOW_THRESHOLD) {
    packet[8] |= 0x01; // Low Battery Flag
  }

  packet[9] = g_probe_fault;
  packet[10] = g_runtime.link_quality_valid ? g_runtime.link_quality : 0xFF;
  packet[11] = g_runtime.last_rpd_seen;
  packet[12] = (uint8_t)(g_runtime.seq_num & 0xFF);
  packet[13] = (uint8_t)((g_runtime.seq_num >> 8) & 0xFF);
  packet[14] = (uint8_t)((g_runtime.seq_num >> 16) & 0xFF);
  packet[15] = (uint8_t)((g_runtime.seq_num >> 24) & 0xFF);
  packet[31] = calculate_checksum(packet, 32);
}

static tx_send_result_t send_data_with_retry(runtime_state_t *runtime,
                                             uint8_t *packet) {
  for (uint8_t attempt = 0; attempt < DATA_MAX_RETRIES; attempt++) {
    radio_power_up_tx();
    radio_set_tx_addr(PAIRING_ADDR);

#if USE_WIRELESS_LORA
    // LoRa: 1 clean packet per attempt so sensor enters RX before Controller
    // sends ACK
    radio_send(packet, 32);
#else
    for (int burst = 0; burst < 3; burst++) {
      radio_send(packet, 32);

      tx_wait_result_t gap_result =
          service_runtime_window(runtime, 10, false, attempt, runtime->seq_num);
      if (gap_result == TX_WAIT_ABORTED) {
        radio_power_down();
        return TX_SEND_ABORTED;
      }
    }
#endif

    DEBUG_PRINT("[TX] Seq:%lu try:%d\r\n", (unsigned long)runtime->seq_num,
                attempt);

    radio_flush_rx();
    radio_power_up_rx();

    tx_wait_result_t ack_result = service_runtime_window(
        runtime, DATA_ACK_WAIT_MS, true, attempt, runtime->seq_num);
    bool rpd_seen = radio_take_rpd();

    if (ack_result == TX_WAIT_ACK_RECEIVED) {
      update_link_quality(runtime, attempt, true, rpd_seen);
      radio_power_down();
      return TX_SEND_ACKED;
    }
    if (ack_result == TX_WAIT_ABORTED) {
      radio_power_down();
      return TX_SEND_ABORTED;
    }

    update_link_quality(runtime, attempt, false, rpd_seen);

    if (attempt < DATA_MAX_RETRIES - 1) {
      uint32_t retry_jitter_ms =
          DATA_RETRY_DELAY_MS + ((millis() + attempt) & 0x1F) * 2;
      tx_wait_result_t retry_result = service_runtime_window(
          runtime, retry_jitter_ms, false, attempt, runtime->seq_num);
      if (retry_result == TX_WAIT_ABORTED) {
        radio_power_down();
        return TX_SEND_ABORTED;
      }
    }
  }

  radio_power_down();
  return TX_SEND_NO_ACK;
}

/* ========== TIM2 for millis (1ms) ========== */
void TIM2_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void TIM2_IRQHandler(void) {
  if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET) {
    g_millis++;
    TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
  }
}

