abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
void timer_init(void) {
  TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure = {0};
  NVIC_InitTypeDef NVIC_InitStructure = {0};
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

  // Period 9 and Prescaler for 1ms interrupt
  TIM_TimeBaseStructure.TIM_Period = 9;
  TIM_TimeBaseStructure.TIM_Prescaler = (SystemCoreClock / 10000) - 1;
  TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

  TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
  NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  TIM_Cmd(TIM2, ENABLE);
}

uint32_t millis(void) { return g_millis; }

/* ========== GPIO Init ========== */
void gpio_init(void) {
  GPIO_InitTypeDef GPIO_InitStructure = {0};
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOA, ENABLE);

  // Button: PD6 (Input Pull-up)
  GPIO_InitStructure.GPIO_Pin = BUTTON_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOD, &GPIO_InitStructure);

  // LED: PD2 (Output Push-pull)
  GPIO_InitStructure.GPIO_Pin = LED_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOD, &GPIO_InitStructure);

  GPIO_SetBits(GPIOD, LED_PIN); // Turn off at start (Active-Low)

  // Sensor Common Power: PD3 (Output Push-pull, initially 0V / OFF)
  GPIO_InitStructure.GPIO_Pin = SENSOR_POWER_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOD, SENSOR_POWER_PIN); // Keep OFF during sleep

  // Sensor Pins: PC0, PC1, PC2, PC4 (Input Pull-up)
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
  GPIO_InitStructure.GPIO_Pin =
      SENSOR_PIN_25 | SENSOR_PIN_50 | SENSOR_PIN_75 | SENSOR_PIN_100;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  // Initialize EXTI for these pins
  exti_init();
}

/**
 * @brief Reads all tank probes and applies software patches for hardware
 * reliability and fault monitoring.
 *
 * LOGIC EXPLANATION (Hardware Patch):
 * In a standard water tank, if a higher probe (e.g., 50%) is touching water,
 * all probes below it (e.g., 25%) MUST also be touching water.
 * If a lower probe wire is broken or the probe is oxidized, it might
 * report "Dry" even when the tank is half full.
 *
 * This function handles two critical tasks:
 * 1. PROBE FAULT DETECTION: It checks if there's a "gap" in readings (e.g.,
 *    100% is wet but 25% is dry). If a gap is found, it sets g_probe_fault=1
 *    to alert the user about possible broken wires or dirty sensors.
 *
 * 2. BROKEN WIRE FIX: Even if a lower probe is faulty, the function
 *    automatically fills in the gap in software to ensure the displayed
 *    water level remains accurate.
 *
 * Benefit: Prevents "jumpy" or incorrect readings and provides a "Service
 * Required" alert if hardware maintenance is needed.
 */
uint8_t read_internal_probes(uint8_t *fault_out) {
  // 1. Power ON the common probe wire (PD3)
  GPIO_SetBits(GPIOD, SENSOR_POWER_PIN);
  Delay_Ms(PROBE_SETTLE_DELAY_MS); // Allow water conductivity & transistor junction to stabilize

  // 2. Take multi-samples to filter contact resistance & AC ripple
  uint8_t c25 = 0, c50 = 0, c75 = 0, c100 = 0;
  for (int s = 0; s < PROBE_SAMPLE_COUNT; s++) {
    if (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_25) == 0)
      c25++;
    if (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_50) == 0)
      c50++;
    if (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_75) == 0)
      c75++;
    if (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_100) == 0)
      c100++;
    Delay_Ms(2);
  }

  // 3. Power OFF probe wire immediately (keeps average power < 0.01mW)
  GPIO_ResetBits(GPIOD, SENSOR_POWER_PIN);
  Delay_Ms(1); // Settle & drain residual wire capacitance

  // Majority vote: >= PROBE_MAJORITY_VOTE out of PROBE_SAMPLE_COUNT (e.g. >= 3 out of 5)
  uint8_t p25 = (c25 >= PROBE_MAJORITY_VOTE);
  uint8_t p50 = (c50 >= PROBE_MAJORITY_VOTE);
  uint8_t p75 = (c75 >= PROBE_MAJORITY_VOTE);
  uint8_t p100 = (c100 >= PROBE_MAJORITY_VOTE);

  DEBUG_PRINT("[PROBES] Raw hits (out of %d): [25%%]:%d [50%%]:%d [75%%]:%d [100%%]:%d\r\n",
              PROBE_SAMPLE_COUNT, c25, c50, c75, c100);

  // --- FAULT DETECTION LOGIC: Bitmask Mode ---
  uint8_t fault_mask = 0;
  if (p100) {
    if (!p75)
      fault_mask |= (1 << 2);
    if (!p50)
      fault_mask |= (1 << 1);
    if (!p25)
      fault_mask |= (1 << 0);
  } else if (p75) {
    if (!p50)
      fault_mask |= (1 << 1);
    if (!p25)
      fault_mask |= (1 << 0);
  } else if (p50) {
    if (!p25)
      fault_mask |= (1 << 0);
  }

  if (fault_out)
    *fault_out = fault_mask;

  // --- HARDWARE PATCH: Broken Wire Fix ---
  if (p100) {
    p75 = 1;
    p50 = 1;
    p25 = 1;
  } else if (p75) {
    p50 = 1;
    p25 = 1;
  } else if (p50) {
    p25 = 1;
  }

  if (p100)
    return 100;
  if (p75)
    return 75;
  if (p50)
    return 50;
  if (p25)
    return 25;
  return 0;
}

uint8_t read_tank_level(void) {
  uint8_t fault = 0;
  uint8_t level = read_internal_probes(&fault);
  g_probe_fault = fault;

  DEBUG_PRINT("[DATA] Tank Level: %d%%\r\n", level);
  return level;
}

/* ========== ADC for Battery Monitoring (PA1) ========== */
void adc_init(void) {
  ADC_InitTypeDef ADC_InitStructure = {0};
  GPIO_InitTypeDef GPIO_InitStructure = {0};

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_ADC1, ENABLE);
  RCC_ADCCLKConfig(RCC_PCLK2_Div8);

  GPIO_InitStructure.GPIO_Pin = BATTERY_ADC_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  ADC_DeInit(ADC1);
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = DISABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  ADC_Init(ADC1, &ADC_InitStructure);

  ADC_Cmd(ADC1, ENABLE);

  // Calibration
  ADC_ResetCalibration(ADC1);
  while (ADC_GetResetCalibrationStatus(ADC1))
    ;
  ADC_StartCalibration(ADC1);
  while (ADC_GetCalibrationStatus(ADC1))
    ;
}

uint16_t get_adc_val(uint8_t ch) {
  ADC_RegularChannelConfig(ADC1, ch, 1, ADC_SampleTime_241Cycles);
  ADC_SoftwareStartConvCmd(ADC1, ENABLE);
  volatile uint32_t timeout = 50000;
  while (!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) && --timeout)
    ;
  if (timeout == 0) {
    DEBUG_PRINT("[ADC] TIMEOUT ch%d!\r\n", ch);
    return 0;
  }
  return ADC_GetConversionValue(ADC1);
}

uint8_t read_battery_level(void) {
  uint32_t accum = 0;
  uint8_t i;

